back_end/test/load_test/load_test.yml
config:
  target: "http://localhost:8080/api"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up

    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Load Test

  payload:
    path: "./data.csv"
    fields:
      - "email"
      - "password"
      - "userId"
      - "groupId"
      - "eventId"
    order: sequence
    skipHeader: true
  

scenarios:
  - name: "Log in"
    # This simulates logging in to the user account and retrieving the data.
    flow:
      - post:
          url: "/users/getUser"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
         
      - post:
          url: "/users/getUserById"
          json:
            id: "{{ userId }}"
          

  - name: "Populate Calendar"
    # Simulate retrieving event data for the calendar for a family group
    flow: 
      - post:
          url: "/familyGroups/getFamilyGroup"
          json:
            groupId: "{{ groupId }}"
      - post:
          url: "/familyGroups/getFamilyGroupEvents"
          json:
            groupId: "{{ groupId }}"

  - name: "Get and Edit an Event"
    # Simulate updating an event.
    flow:  
      - post:
          url: "/events/updateEvent"
          json:
            id: "{{ eventId }}"
            creationUser: "{{ userId }}"