back_end/test/load_test/load_test.yml
config:
  target: "http://localhost:8080/api"
  phases:
  # Each user makes 5 request to the application. 200 users making 5 requests results in 1000 requests in a minute
    - duration: 60
      arrivalCount: 200
      name: Load Test

  payload:
    path: "./data.csv"
    fields:
      - "email"
      - "password"
      - "userId"
      - "groupId"
      - "eventId"
    order: sequence
    skipHeader: true
  

scenarios:
  - name: "Log in"
    # This simulates logging in to the user account and retrieving the data. (2 requests)
    flow:
      - post:
          url: "/users/getUser"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
         
      - post:
          url: "/users/getUserById"
          json:
            id: "{{ userId }}"
          

  - name: "Populate Calendar"
    # Simulate retrieving event data for the calendar for a family group. (2 requests)
    flow: 
      - post:
          url: "/familyGroups/getFamilyGroup"
          json:
            groupId: "{{ groupId }}"
      - post:
          url: "/familyGroups/getFamilyGroupEvents"
          json:
            groupId: "{{ groupId }}"

  - name: "Get and Edit an Event"
    # Simulate updating an event. (1 request)
    flow:  
      - post:
          url: "/events/updateEvent"
          json:
            id: "{{ eventId }}"
            creationUser: "{{ userId }}"